Revit 2017 API
AssetPropertyList Class
 Represents a list of AssetProperty(s).
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public class AssetPropertyList : AssetProperty
Visual Basic
Public Class AssetPropertyList _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyList : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyList
See Also
AssetPropertyList Members
Autodesk.Revit.Utility Namespace